zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/twi.h
/**
 * \brief Component description for PIC32CZ/CA70 TWI
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_TWI_COMPONENT_H_
#define _PIC32CZ_CA70_TWI_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_TWI Two-wire Interface
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR TWI */
/* ========================================================================== */

/* -------- TWI_CR : (TWI Offset: 0x00) (/W 32) Control Register -------- */

typedef union
{
  struct
  {
    uint32_t START:1;                   /**< bit:      0  Send a START Condition                        */
    uint32_t STOP:1;                    /**< bit:      1  Send a STOP Condition                         */
    uint32_t MSEN:1;                    /**< bit:      2  TWI Master Mode Enabled                       */
    uint32_t MSDIS:1;                   /**< bit:      3  TWI Master Mode Disabled                      */
    uint32_t SVEN:1;                    /**< bit:      4  TWI Slave Mode Enabled                        */
    uint32_t SVDIS:1;                   /**< bit:      5  TWI Slave Mode Disabled                       */
    uint32_t QUICK:1;                   /**< bit:      6  SMBus Quick Command                           */
    uint32_t SWRST:1;                   /**< bit:      7  Software Reset                                */
    uint32_t HSEN:1;                    /**< bit:      8  TWI High-Speed Mode Enabled                   */
    uint32_t HSDIS:1;                   /**< bit:      9  TWI High-Speed Mode Disabled                  */
    uint32_t SMBEN:1;                   /**< bit:     10  SMBus Mode Enabled                            */
    uint32_t SMBDIS:1;                  /**< bit:     11  SMBus Mode Disabled                           */
    uint32_t PECEN:1;                   /**< bit:     12  Packet Error Checking Enable                  */
    uint32_t PECDIS:1;                  /**< bit:     13  Packet Error Checking Disable                 */
    uint32_t PECRQ:1;                   /**< bit:     14  PEC Request                                   */
    uint32_t CLEAR:1;                   /**< bit:     15  Bus CLEAR Command                             */
    uint32_t ACMEN:1;                   /**< bit:     16  Alternative Command Mode Enable               */
    uint32_t ACMDIS:1;                  /**< bit:     17  Alternative Command Mode Disable              */
    uint32_t :6;                        /**< bit: 18..23  Reserved                                      */
    uint32_t THRCLR:1;                  /**< bit:     24  Transmit Holding Register Clear               */
    uint32_t :1;                        /**< bit:     25  Reserved                                      */
    uint32_t LOCKCLR:1;                 /**< bit:     26  Lock Clear                                    */
    uint32_t :1;                        /**< bit:     27  Reserved                                      */
    uint32_t FIFOEN:1;                  /**< bit:     28  FIFO Enable                                   */
    uint32_t FIFODIS:1;                 /**< bit:     29  FIFO Disable                                  */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __TWI_CR_bits_t;

#define TWI_CR_START_Pos                      (0)                                            /**< (TWI_CR) Send a START Condition Position */
#define TWI_CR_START_Msk                      (0x1U << TWI_CR_START_Pos)                     /**< (TWI_CR) Send a START Condition Mask */
#define TWI_CR_STOP_Pos                       (1)                                            /**< (TWI_CR) Send a STOP Condition Position */
#define TWI_CR_STOP_Msk                       (0x1U << TWI_CR_STOP_Pos)                      /**< (TWI_CR) Send a STOP Condition Mask */
#define TWI_CR_MSEN_Pos                       (2)                                            /**< (TWI_CR) TWI Master Mode Enabled Position */
#define TWI_CR_MSEN_Msk                       (0x1U << TWI_CR_MSEN_Pos)                      /**< (TWI_CR) TWI Master Mode Enabled Mask */
#define TWI_CR_MSDIS_Pos                      (3)                                            /**< (TWI_CR) TWI Master Mode Disabled Position */
#define TWI_CR_MSDIS_Msk                      (0x1U << TWI_CR_MSDIS_Pos)                     /**< (TWI_CR) TWI Master Mode Disabled Mask */
#define TWI_CR_SVEN_Pos                       (4)                                            /**< (TWI_CR) TWI Slave Mode Enabled Position */
#define TWI_CR_SVEN_Msk                       (0x1U << TWI_CR_SVEN_Pos)                      /**< (TWI_CR) TWI Slave Mode Enabled Mask */
#define TWI_CR_SVDIS_Pos                      (5)                                            /**< (TWI_CR) TWI Slave Mode Disabled Position */
#define TWI_CR_SVDIS_Msk                      (0x1U << TWI_CR_SVDIS_Pos)                     /**< (TWI_CR) TWI Slave Mode Disabled Mask */
#define TWI_CR_QUICK_Pos                      (6)                                            /**< (TWI_CR) SMBus Quick Command Position */
#define TWI_CR_QUICK_Msk                      (0x1U << TWI_CR_QUICK_Pos)                     /**< (TWI_CR) SMBus Quick Command Mask */
#define TWI_CR_SWRST_Pos                      (7)                                            /**< (TWI_CR) Software Reset Position */
#define TWI_CR_SWRST_Msk                      (0x1U << TWI_CR_SWRST_Pos)                     /**< (TWI_CR) Software Reset Mask */
#define TWI_CR_HSEN_Pos                       (8)                                            /**< (TWI_CR) TWI High-Speed Mode Enabled Position */
#define TWI_CR_HSEN_Msk                       (0x1U << TWI_CR_HSEN_Pos)                      /**< (TWI_CR) TWI High-Speed Mode Enabled Mask */
#define TWI_CR_HSDIS_Pos                      (9)                                            /**< (TWI_CR) TWI High-Speed Mode Disabled Position */
#define TWI_CR_HSDIS_Msk                      (0x1U << TWI_CR_HSDIS_Pos)                     /**< (TWI_CR) TWI High-Speed Mode Disabled Mask */
#define TWI_CR_SMBEN_Pos                      (10)                                           /**< (TWI_CR) SMBus Mode Enabled Position */
#define TWI_CR_SMBEN_Msk                      (0x1U << TWI_CR_SMBEN_Pos)                     /**< (TWI_CR) SMBus Mode Enabled Mask */
#define TWI_CR_SMBDIS_Pos                     (11)                                           /**< (TWI_CR) SMBus Mode Disabled Position */
#define TWI_CR_SMBDIS_Msk                     (0x1U << TWI_CR_SMBDIS_Pos)                    /**< (TWI_CR) SMBus Mode Disabled Mask */
#define TWI_CR_PECEN_Pos                      (12)                                           /**< (TWI_CR) Packet Error Checking Enable Position */
#define TWI_CR_PECEN_Msk                      (0x1U << TWI_CR_PECEN_Pos)                     /**< (TWI_CR) Packet Error Checking Enable Mask */
#define TWI_CR_PECDIS_Pos                     (13)                                           /**< (TWI_CR) Packet Error Checking Disable Position */
#define TWI_CR_PECDIS_Msk                     (0x1U << TWI_CR_PECDIS_Pos)                    /**< (TWI_CR) Packet Error Checking Disable Mask */
#define TWI_CR_PECRQ_Pos                      (14)                                           /**< (TWI_CR) PEC Request Position */
#define TWI_CR_PECRQ_Msk                      (0x1U << TWI_CR_PECRQ_Pos)                     /**< (TWI_CR) PEC Request Mask */
#define TWI_CR_CLEAR_Pos                      (15)                                           /**< (TWI_CR) Bus CLEAR Command Position */
#define TWI_CR_CLEAR_Msk                      (0x1U << TWI_CR_CLEAR_Pos)                     /**< (TWI_CR) Bus CLEAR Command Mask */
#define TWI_CR_ACMEN_Pos                      (16)                                           /**< (TWI_CR) Alternative Command Mode Enable Position */
#define TWI_CR_ACMEN_Msk                      (0x1U << TWI_CR_ACMEN_Pos)                     /**< (TWI_CR) Alternative Command Mode Enable Mask */
#define TWI_CR_ACMDIS_Pos                     (17)                                           /**< (TWI_CR) Alternative Command Mode Disable Position */
#define TWI_CR_ACMDIS_Msk                     (0x1U << TWI_CR_ACMDIS_Pos)                    /**< (TWI_CR) Alternative Command Mode Disable Mask */
#define TWI_CR_THRCLR_Pos                     (24)                                           /**< (TWI_CR) Transmit Holding Register Clear Position */
#define TWI_CR_THRCLR_Msk                     (0x1U << TWI_CR_THRCLR_Pos)                    /**< (TWI_CR) Transmit Holding Register Clear Mask */
#define TWI_CR_LOCKCLR_Pos                    (26)                                           /**< (TWI_CR) Lock Clear Position */
#define TWI_CR_LOCKCLR_Msk                    (0x1U << TWI_CR_LOCKCLR_Pos)                   /**< (TWI_CR) Lock Clear Mask */
#define TWI_CR_FIFOEN_Pos                     (28)                                           /**< (TWI_CR) FIFO Enable Position */
#define TWI_CR_FIFOEN_Msk                     (0x1U << TWI_CR_FIFOEN_Pos)                    /**< (TWI_CR) FIFO Enable Mask */
#define TWI_CR_FIFODIS_Pos                    (29)                                           /**< (TWI_CR) FIFO Disable Position */
#define TWI_CR_FIFODIS_Msk                    (0x1U << TWI_CR_FIFODIS_Pos)                   /**< (TWI_CR) FIFO Disable Mask */
#define TWI_CR_Msk                            (0x3503FFFFUL)                                 /**< (TWI_CR) Register Mask  */

/* -------- TWI_MMR : (TWI Offset: 0x04) (R/W 32) Master Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t :8;                        /**< bit:   0..7  Reserved                                      */
    uint32_t IADRSZ:2;                  /**< bit:   8..9  Internal Device Address Size                  */
    uint32_t :2;                        /**< bit: 10..11  Reserved                                      */
    uint32_t MREAD:1;                   /**< bit:     12  Master Read Direction                         */
    uint32_t :3;                        /**< bit: 13..15  Reserved                                      */
    uint32_t DADR:7;                    /**< bit: 16..22  Device Address                                */
    uint32_t :9;                        /**< bit: 23..31  Reserved                                      */
  };
  uint32_t w;
} __TWI_MMR_bits_t;

#define TWI_MMR_IADRSZ_Pos                    (8)                                            /**< (TWI_MMR) Internal Device Address Size Position */
#define TWI_MMR_IADRSZ_Msk                    (0x3U << TWI_MMR_IADRSZ_Pos)                   /**< (TWI_MMR) Internal Device Address Size Mask */
#define TWI_MMR_IADRSZ(value)                 (TWI_MMR_IADRSZ_Msk & ((value) << TWI_MMR_IADRSZ_Pos))
#define   TWI_MMR_IADRSZ_NONE_Val             (0x0U)                                         /**< (TWI_MMR) No internal device address  */
#define   TWI_MMR_IADRSZ_1_BYTE_Val           (0x1U)                                         /**< (TWI_MMR) One-byte internal device address  */
#define   TWI_MMR_IADRSZ_2_BYTE_Val           (0x2U)                                         /**< (TWI_MMR) Two-byte internal device address  */
#define   TWI_MMR_IADRSZ_3_BYTE_Val           (0x3U)                                         /**< (TWI_MMR) Three-byte internal device address  */
#define TWI_MMR_IADRSZ_NONE                   (TWI_MMR_IADRSZ_NONE_Val << TWI_MMR_IADRSZ_Pos)  /**< (TWI_MMR) No internal device address Position  */
#define TWI_MMR_IADRSZ_1_BYTE                 (TWI_MMR_IADRSZ_1_BYTE_Val << TWI_MMR_IADRSZ_Pos)  /**< (TWI_MMR) One-byte internal device address Position  */
#define TWI_MMR_IADRSZ_2_BYTE                 (TWI_MMR_IADRSZ_2_BYTE_Val << TWI_MMR_IADRSZ_Pos)  /**< (TWI_MMR) Two-byte internal device address Position  */
#define TWI_MMR_IADRSZ_3_BYTE                 (TWI_MMR_IADRSZ_3_BYTE_Val << TWI_MMR_IADRSZ_Pos)  /**< (TWI_MMR) Three-byte internal device address Position  */
#define TWI_MMR_MREAD_Pos                     (12)                                           /**< (TWI_MMR) Master Read Direction Position */
#define TWI_MMR_MREAD_Msk                     (0x1U << TWI_MMR_MREAD_Pos)                    /**< (TWI_MMR) Master Read Direction Mask */
#define TWI_MMR_DADR_Pos                      (16)                                           /**< (TWI_MMR) Device Address Position */
#define TWI_MMR_DADR_Msk                      (0x7FU << TWI_MMR_DADR_Pos)                    /**< (TWI_MMR) Device Address Mask */
#define TWI_MMR_DADR(value)                   (TWI_MMR_DADR_Msk & ((value) << TWI_MMR_DADR_Pos))
#define TWI_MMR_Msk                           (0x007F1300UL)                                 /**< (TWI_MMR) Register Mask  */

/* -------- TWI_SMR : (TWI Offset: 0x08) (R/W 32) Slave Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t NACKEN:1;                  /**< bit:      0  Slave Receiver Data Phase NACK enable         */
    uint32_t :1;                        /**< bit:      1  Reserved                                      */
    uint32_t SMDA:1;                    /**< bit:      2  SMBus Default Address                         */
    uint32_t SMHH:1;                    /**< bit:      3  SMBus Host Header                             */
    uint32_t :2;                        /**< bit:   4..5  Reserved                                      */
    uint32_t SCLWSDIS:1;                /**< bit:      6  Clock Wait State Disable                      */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t MASK:7;                    /**< bit:  8..14  Slave Address Mask                            */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t SADR:7;                    /**< bit: 16..22  Slave Address                                 */
    uint32_t :5;                        /**< bit: 23..27  Reserved                                      */
    uint32_t SADR1EN:1;                 /**< bit:     28  Slave Address 1 Enable                        */
    uint32_t SADR2EN:1;                 /**< bit:     29  Slave Address 2 Enable                        */
    uint32_t SADR3EN:1;                 /**< bit:     30  Slave Address 3 Enable                        */
    uint32_t DATAMEN:1;                 /**< bit:     31  Data Matching Enable                          */
  };
  uint32_t w;
} __TWI_SMR_bits_t;

#define TWI_SMR_NACKEN_Pos                    (0)                                            /**< (TWI_SMR) Slave Receiver Data Phase NACK enable Position */
#define TWI_SMR_NACKEN_Msk                    (0x1U << TWI_SMR_NACKEN_Pos)                   /**< (TWI_SMR) Slave Receiver Data Phase NACK enable Mask */
#define TWI_SMR_SMDA_Pos                      (2)                                            /**< (TWI_SMR) SMBus Default Address Position */
#define TWI_SMR_SMDA_Msk                      (0x1U << TWI_SMR_SMDA_Pos)                     /**< (TWI_SMR) SMBus Default Address Mask */
#define TWI_SMR_SMHH_Pos                      (3)                                            /**< (TWI_SMR) SMBus Host Header Position */
#define TWI_SMR_SMHH_Msk                      (0x1U << TWI_SMR_SMHH_Pos)                     /**< (TWI_SMR) SMBus Host Header Mask */
#define TWI_SMR_SCLWSDIS_Pos                  (6)                                            /**< (TWI_SMR) Clock Wait State Disable Position */
#define TWI_SMR_SCLWSDIS_Msk                  (0x1U << TWI_SMR_SCLWSDIS_Pos)                 /**< (TWI_SMR) Clock Wait State Disable Mask */
#define TWI_SMR_MASK_Pos                      (8)                                            /**< (TWI_SMR) Slave Address Mask Position */
#define TWI_SMR_MASK_Msk                      (0x7FU << TWI_SMR_MASK_Pos)                    /**< (TWI_SMR) Slave Address Mask Mask */
#define TWI_SMR_MASK(value)                   (TWI_SMR_MASK_Msk & ((value) << TWI_SMR_MASK_Pos))
#define TWI_SMR_SADR_Pos                      (16)                                           /**< (TWI_SMR) Slave Address Position */
#define TWI_SMR_SADR_Msk                      (0x7FU << TWI_SMR_SADR_Pos)                    /**< (TWI_SMR) Slave Address Mask */
#define TWI_SMR_SADR(value)                   (TWI_SMR_SADR_Msk & ((value) << TWI_SMR_SADR_Pos))
#define TWI_SMR_SADR1EN_Pos                   (28)                                           /**< (TWI_SMR) Slave Address 1 Enable Position */
#define TWI_SMR_SADR1EN_Msk                   (0x1U << TWI_SMR_SADR1EN_Pos)                  /**< (TWI_SMR) Slave Address 1 Enable Mask */
#define TWI_SMR_SADR2EN_Pos                   (29)                                           /**< (TWI_SMR) Slave Address 2 Enable Position */
#define TWI_SMR_SADR2EN_Msk                   (0x1U << TWI_SMR_SADR2EN_Pos)                  /**< (TWI_SMR) Slave Address 2 Enable Mask */
#define TWI_SMR_SADR3EN_Pos                   (30)                                           /**< (TWI_SMR) Slave Address 3 Enable Position */
#define TWI_SMR_SADR3EN_Msk                   (0x1U << TWI_SMR_SADR3EN_Pos)                  /**< (TWI_SMR) Slave Address 3 Enable Mask */
#define TWI_SMR_DATAMEN_Pos                   (31)                                           /**< (TWI_SMR) Data Matching Enable Position */
#define TWI_SMR_DATAMEN_Msk                   (0x1U << TWI_SMR_DATAMEN_Pos)                  /**< (TWI_SMR) Data Matching Enable Mask */
#define TWI_SMR_Msk                           (0xF07F7F4DUL)                                 /**< (TWI_SMR) Register Mask  */

/* -------- TWI_IADR : (TWI Offset: 0x0c) (R/W 32) Internal Address Register -------- */

typedef union
{
  struct
  {
    uint32_t IADR:24;                   /**< bit:  0..23  Internal Address                              */
    uint32_t :8;                        /**< bit: 24..31  Reserved                                      */
  };
  uint32_t w;
} __TWI_IADR_bits_t;

#define TWI_IADR_IADR_Pos                     (0)                                            /**< (TWI_IADR) Internal Address Position */
#define TWI_IADR_IADR_Msk                     (0xFFFFFFU << TWI_IADR_IADR_Pos)               /**< (TWI_IADR) Internal Address Mask */
#define TWI_IADR_IADR(value)                  (TWI_IADR_IADR_Msk & ((value) << TWI_IADR_IADR_Pos))
#define TWI_IADR_Msk                          (0x00FFFFFFUL)                                 /**< (TWI_IADR) Register Mask  */

