zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/twi.h
/* -------- TWI_CWGR : (TWI Offset: 0x10) (R/W 32) Clock Waveform Generator Register -------- */

typedef union
{
  struct
  {
    uint32_t CLDIV:8;                   /**< bit:   0..7  Clock Low Divider                             */
    uint32_t CHDIV:8;                   /**< bit:  8..15  Clock High Divider                            */
    uint32_t CKDIV:3;                   /**< bit: 16..18  Clock Divider                                 */
    uint32_t :5;                        /**< bit: 19..23  Reserved                                      */
    uint32_t HOLD:6;                    /**< bit: 24..29  TWD Hold Time Versus TWCK Falling             */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __TWI_CWGR_bits_t;

#define TWI_CWGR_CLDIV_Pos                    (0)                                            /**< (TWI_CWGR) Clock Low Divider Position */
#define TWI_CWGR_CLDIV_Msk                    (0xFFU << TWI_CWGR_CLDIV_Pos)                  /**< (TWI_CWGR) Clock Low Divider Mask */
#define TWI_CWGR_CLDIV(value)                 (TWI_CWGR_CLDIV_Msk & ((value) << TWI_CWGR_CLDIV_Pos))
#define TWI_CWGR_CHDIV_Pos                    (8)                                            /**< (TWI_CWGR) Clock High Divider Position */
#define TWI_CWGR_CHDIV_Msk                    (0xFFU << TWI_CWGR_CHDIV_Pos)                  /**< (TWI_CWGR) Clock High Divider Mask */
#define TWI_CWGR_CHDIV(value)                 (TWI_CWGR_CHDIV_Msk & ((value) << TWI_CWGR_CHDIV_Pos))
#define TWI_CWGR_CKDIV_Pos                    (16)                                           /**< (TWI_CWGR) Clock Divider Position */
#define TWI_CWGR_CKDIV_Msk                    (0x7U << TWI_CWGR_CKDIV_Pos)                   /**< (TWI_CWGR) Clock Divider Mask */
#define TWI_CWGR_CKDIV(value)                 (TWI_CWGR_CKDIV_Msk & ((value) << TWI_CWGR_CKDIV_Pos))
#define TWI_CWGR_HOLD_Pos                     (24)                                           /**< (TWI_CWGR) TWD Hold Time Versus TWCK Falling Position */
#define TWI_CWGR_HOLD_Msk                     (0x3FU << TWI_CWGR_HOLD_Pos)                   /**< (TWI_CWGR) TWD Hold Time Versus TWCK Falling Mask */
#define TWI_CWGR_HOLD(value)                  (TWI_CWGR_HOLD_Msk & ((value) << TWI_CWGR_HOLD_Pos))
#define TWI_CWGR_Msk                          (0x3F07FFFFUL)                                 /**< (TWI_CWGR) Register Mask  */

/* -------- TWI_SR : (TWI Offset: 0x20) (R/ 32) Status Register -------- */

typedef union
{
  struct
  {
    uint32_t TXCOMP:1;                  /**< bit:      0  Transmission Completed (cleared by writing TWI_THR) */
    uint32_t RXRDY:1;                   /**< bit:      1  Receive Holding Register Ready (cleared by reading TWI_RHR) */
    uint32_t TXRDY:1;                   /**< bit:      2  Transmit Holding Register Ready (cleared by writing TWI_THR) */
    uint32_t SVREAD:1;                  /**< bit:      3  Slave Read                                    */
    uint32_t SVACC:1;                   /**< bit:      4  Slave Access                                  */
    uint32_t GACC:1;                    /**< bit:      5  General Call Access (cleared on read)         */
    uint32_t OVRE:1;                    /**< bit:      6  Overrun Error (cleared on read)               */
    uint32_t UNRE:1;                    /**< bit:      7  Underrun Error (cleared on read)              */
    uint32_t NACK:1;                    /**< bit:      8  Not Acknowledged (cleared on read)            */
    uint32_t ARBLST:1;                  /**< bit:      9  Arbitration Lost (cleared on read)            */
    uint32_t SCLWS:1;                   /**< bit:     10  Clock Wait State                              */
    uint32_t EOSACC:1;                  /**< bit:     11  End Of Slave Access (cleared on read)         */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t MCACK:1;                   /**< bit:     16  Master Code Acknowledge (cleared on read)     */
    uint32_t :1;                        /**< bit:     17  Reserved                                      */
    uint32_t TOUT:1;                    /**< bit:     18  Timeout Error (cleared on read)               */
    uint32_t PECERR:1;                  /**< bit:     19  PEC Error (cleared on read)                   */
    uint32_t SMBDAM:1;                  /**< bit:     20  SMBus Default Address Match (cleared on read) */
    uint32_t SMBHHM:1;                  /**< bit:     21  SMBus Host Header Address Match (cleared on read) */
    uint32_t :2;                        /**< bit: 22..23  Reserved                                      */
    uint32_t SCL:1;                     /**< bit:     24  SCL Line Value                                */
    uint32_t SDA:1;                     /**< bit:     25  SDA Line Value                                */
    uint32_t :6;                        /**< bit: 26..31  Reserved                                      */
  };
  uint32_t w;
} __TWI_SR_bits_t;

#define TWI_SR_TXCOMP_Pos                     (0)                                            /**< (TWI_SR) Transmission Completed (cleared by writing TWI_THR) Position */
#define TWI_SR_TXCOMP_Msk                     (0x1U << TWI_SR_TXCOMP_Pos)                    /**< (TWI_SR) Transmission Completed (cleared by writing TWI_THR) Mask */
#define TWI_SR_RXRDY_Pos                      (1)                                            /**< (TWI_SR) Receive Holding Register Ready (cleared by reading TWI_RHR) Position */
#define TWI_SR_RXRDY_Msk                      (0x1U << TWI_SR_RXRDY_Pos)                     /**< (TWI_SR) Receive Holding Register Ready (cleared by reading TWI_RHR) Mask */
#define TWI_SR_TXRDY_Pos                      (2)                                            /**< (TWI_SR) Transmit Holding Register Ready (cleared by writing TWI_THR) Position */
#define TWI_SR_TXRDY_Msk                      (0x1U << TWI_SR_TXRDY_Pos)                     /**< (TWI_SR) Transmit Holding Register Ready (cleared by writing TWI_THR) Mask */
#define TWI_SR_SVREAD_Pos                     (3)                                            /**< (TWI_SR) Slave Read Position */
#define TWI_SR_SVREAD_Msk                     (0x1U << TWI_SR_SVREAD_Pos)                    /**< (TWI_SR) Slave Read Mask */
#define TWI_SR_SVACC_Pos                      (4)                                            /**< (TWI_SR) Slave Access Position */
#define TWI_SR_SVACC_Msk                      (0x1U << TWI_SR_SVACC_Pos)                     /**< (TWI_SR) Slave Access Mask */
#define TWI_SR_GACC_Pos                       (5)                                            /**< (TWI_SR) General Call Access (cleared on read) Position */
#define TWI_SR_GACC_Msk                       (0x1U << TWI_SR_GACC_Pos)                      /**< (TWI_SR) General Call Access (cleared on read) Mask */
#define TWI_SR_OVRE_Pos                       (6)                                            /**< (TWI_SR) Overrun Error (cleared on read) Position */
#define TWI_SR_OVRE_Msk                       (0x1U << TWI_SR_OVRE_Pos)                      /**< (TWI_SR) Overrun Error (cleared on read) Mask */
#define TWI_SR_UNRE_Pos                       (7)                                            /**< (TWI_SR) Underrun Error (cleared on read) Position */
#define TWI_SR_UNRE_Msk                       (0x1U << TWI_SR_UNRE_Pos)                      /**< (TWI_SR) Underrun Error (cleared on read) Mask */
#define TWI_SR_NACK_Pos                       (8)                                            /**< (TWI_SR) Not Acknowledged (cleared on read) Position */
#define TWI_SR_NACK_Msk                       (0x1U << TWI_SR_NACK_Pos)                      /**< (TWI_SR) Not Acknowledged (cleared on read) Mask */
#define TWI_SR_ARBLST_Pos                     (9)                                            /**< (TWI_SR) Arbitration Lost (cleared on read) Position */
#define TWI_SR_ARBLST_Msk                     (0x1U << TWI_SR_ARBLST_Pos)                    /**< (TWI_SR) Arbitration Lost (cleared on read) Mask */
#define TWI_SR_SCLWS_Pos                      (10)                                           /**< (TWI_SR) Clock Wait State Position */
#define TWI_SR_SCLWS_Msk                      (0x1U << TWI_SR_SCLWS_Pos)                     /**< (TWI_SR) Clock Wait State Mask */
#define TWI_SR_EOSACC_Pos                     (11)                                           /**< (TWI_SR) End Of Slave Access (cleared on read) Position */
#define TWI_SR_EOSACC_Msk                     (0x1U << TWI_SR_EOSACC_Pos)                    /**< (TWI_SR) End Of Slave Access (cleared on read) Mask */
#define TWI_SR_MCACK_Pos                      (16)                                           /**< (TWI_SR) Master Code Acknowledge (cleared on read) Position */
#define TWI_SR_MCACK_Msk                      (0x1U << TWI_SR_MCACK_Pos)                     /**< (TWI_SR) Master Code Acknowledge (cleared on read) Mask */
#define TWI_SR_TOUT_Pos                       (18)                                           /**< (TWI_SR) Timeout Error (cleared on read) Position */
#define TWI_SR_TOUT_Msk                       (0x1U << TWI_SR_TOUT_Pos)                      /**< (TWI_SR) Timeout Error (cleared on read) Mask */
#define TWI_SR_PECERR_Pos                     (19)                                           /**< (TWI_SR) PEC Error (cleared on read) Position */
#define TWI_SR_PECERR_Msk                     (0x1U << TWI_SR_PECERR_Pos)                    /**< (TWI_SR) PEC Error (cleared on read) Mask */
#define TWI_SR_SMBDAM_Pos                     (20)                                           /**< (TWI_SR) SMBus Default Address Match (cleared on read) Position */
#define TWI_SR_SMBDAM_Msk                     (0x1U << TWI_SR_SMBDAM_Pos)                    /**< (TWI_SR) SMBus Default Address Match (cleared on read) Mask */
#define TWI_SR_SMBHHM_Pos                     (21)                                           /**< (TWI_SR) SMBus Host Header Address Match (cleared on read) Position */
#define TWI_SR_SMBHHM_Msk                     (0x1U << TWI_SR_SMBHHM_Pos)                    /**< (TWI_SR) SMBus Host Header Address Match (cleared on read) Mask */
#define TWI_SR_SCL_Pos                        (24)                                           /**< (TWI_SR) SCL Line Value Position */
#define TWI_SR_SCL_Msk                        (0x1U << TWI_SR_SCL_Pos)                       /**< (TWI_SR) SCL Line Value Mask */
#define TWI_SR_SDA_Pos                        (25)                                           /**< (TWI_SR) SDA Line Value Position */
#define TWI_SR_SDA_Msk                        (0x1U << TWI_SR_SDA_Pos)                       /**< (TWI_SR) SDA Line Value Mask */
#define TWI_SR_Msk                            (0x033D0FFFUL)                                 /**< (TWI_SR) Register Mask  */

/* -------- TWI_IER : (TWI Offset: 0x24) (/W 32) Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t TXCOMP:1;                  /**< bit:      0  Transmission Completed Interrupt Enable       */
    uint32_t RXRDY:1;                   /**< bit:      1  Receive Holding Register Ready Interrupt Enable */
    uint32_t TXRDY:1;                   /**< bit:      2  Transmit Holding Register Ready Interrupt Enable */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t SVACC:1;                   /**< bit:      4  Slave Access Interrupt Enable                 */
    uint32_t GACC:1;                    /**< bit:      5  General Call Access Interrupt Enable          */
    uint32_t OVRE:1;                    /**< bit:      6  Overrun Error Interrupt Enable                */
    uint32_t UNRE:1;                    /**< bit:      7  Underrun Error Interrupt Enable               */
    uint32_t NACK:1;                    /**< bit:      8  Not Acknowledge Interrupt Enable              */
    uint32_t ARBLST:1;                  /**< bit:      9  Arbitration Lost Interrupt Enable             */
    uint32_t SCL_WS:1;                  /**< bit:     10  Clock Wait State Interrupt Enable             */
    uint32_t EOSACC:1;                  /**< bit:     11  End Of Slave Access Interrupt Enable          */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t MCACK:1;                   /**< bit:     16  Master Code Acknowledge Interrupt Enable      */
    uint32_t :1;                        /**< bit:     17  Reserved                                      */
    uint32_t TOUT:1;                    /**< bit:     18  Timeout Error Interrupt Enable                */
    uint32_t PECERR:1;                  /**< bit:     19  PEC Error Interrupt Enable                    */
    uint32_t SMBDAM:1;                  /**< bit:     20  SMBus Default Address Match Interrupt Enable  */
    uint32_t SMBHHM:1;                  /**< bit:     21  SMBus Host Header Address Match Interrupt Enable */
    uint32_t :10;                       /**< bit: 22..31  Reserved                                      */
  };
  uint32_t w;
} __TWI_IER_bits_t;

