zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/twi.h
#define TWI_IER_TXCOMP_Pos                    (0)                                            /**< (TWI_IER) Transmission Completed Interrupt Enable Position */
#define TWI_IER_TXCOMP_Msk                    (0x1U << TWI_IER_TXCOMP_Pos)                   /**< (TWI_IER) Transmission Completed Interrupt Enable Mask */
#define TWI_IER_RXRDY_Pos                     (1)                                            /**< (TWI_IER) Receive Holding Register Ready Interrupt Enable Position */
#define TWI_IER_RXRDY_Msk                     (0x1U << TWI_IER_RXRDY_Pos)                    /**< (TWI_IER) Receive Holding Register Ready Interrupt Enable Mask */
#define TWI_IER_TXRDY_Pos                     (2)                                            /**< (TWI_IER) Transmit Holding Register Ready Interrupt Enable Position */
#define TWI_IER_TXRDY_Msk                     (0x1U << TWI_IER_TXRDY_Pos)                    /**< (TWI_IER) Transmit Holding Register Ready Interrupt Enable Mask */
#define TWI_IER_SVACC_Pos                     (4)                                            /**< (TWI_IER) Slave Access Interrupt Enable Position */
#define TWI_IER_SVACC_Msk                     (0x1U << TWI_IER_SVACC_Pos)                    /**< (TWI_IER) Slave Access Interrupt Enable Mask */
#define TWI_IER_GACC_Pos                      (5)                                            /**< (TWI_IER) General Call Access Interrupt Enable Position */
#define TWI_IER_GACC_Msk                      (0x1U << TWI_IER_GACC_Pos)                     /**< (TWI_IER) General Call Access Interrupt Enable Mask */
#define TWI_IER_OVRE_Pos                      (6)                                            /**< (TWI_IER) Overrun Error Interrupt Enable Position */
#define TWI_IER_OVRE_Msk                      (0x1U << TWI_IER_OVRE_Pos)                     /**< (TWI_IER) Overrun Error Interrupt Enable Mask */
#define TWI_IER_UNRE_Pos                      (7)                                            /**< (TWI_IER) Underrun Error Interrupt Enable Position */
#define TWI_IER_UNRE_Msk                      (0x1U << TWI_IER_UNRE_Pos)                     /**< (TWI_IER) Underrun Error Interrupt Enable Mask */
#define TWI_IER_NACK_Pos                      (8)                                            /**< (TWI_IER) Not Acknowledge Interrupt Enable Position */
#define TWI_IER_NACK_Msk                      (0x1U << TWI_IER_NACK_Pos)                     /**< (TWI_IER) Not Acknowledge Interrupt Enable Mask */
#define TWI_IER_ARBLST_Pos                    (9)                                            /**< (TWI_IER) Arbitration Lost Interrupt Enable Position */
#define TWI_IER_ARBLST_Msk                    (0x1U << TWI_IER_ARBLST_Pos)                   /**< (TWI_IER) Arbitration Lost Interrupt Enable Mask */
#define TWI_IER_SCL_WS_Pos                    (10)                                           /**< (TWI_IER) Clock Wait State Interrupt Enable Position */
#define TWI_IER_SCL_WS_Msk                    (0x1U << TWI_IER_SCL_WS_Pos)                   /**< (TWI_IER) Clock Wait State Interrupt Enable Mask */
#define TWI_IER_EOSACC_Pos                    (11)                                           /**< (TWI_IER) End Of Slave Access Interrupt Enable Position */
#define TWI_IER_EOSACC_Msk                    (0x1U << TWI_IER_EOSACC_Pos)                   /**< (TWI_IER) End Of Slave Access Interrupt Enable Mask */
#define TWI_IER_MCACK_Pos                     (16)                                           /**< (TWI_IER) Master Code Acknowledge Interrupt Enable Position */
#define TWI_IER_MCACK_Msk                     (0x1U << TWI_IER_MCACK_Pos)                    /**< (TWI_IER) Master Code Acknowledge Interrupt Enable Mask */
#define TWI_IER_TOUT_Pos                      (18)                                           /**< (TWI_IER) Timeout Error Interrupt Enable Position */
#define TWI_IER_TOUT_Msk                      (0x1U << TWI_IER_TOUT_Pos)                     /**< (TWI_IER) Timeout Error Interrupt Enable Mask */
#define TWI_IER_PECERR_Pos                    (19)                                           /**< (TWI_IER) PEC Error Interrupt Enable Position */
#define TWI_IER_PECERR_Msk                    (0x1U << TWI_IER_PECERR_Pos)                   /**< (TWI_IER) PEC Error Interrupt Enable Mask */
#define TWI_IER_SMBDAM_Pos                    (20)                                           /**< (TWI_IER) SMBus Default Address Match Interrupt Enable Position */
#define TWI_IER_SMBDAM_Msk                    (0x1U << TWI_IER_SMBDAM_Pos)                   /**< (TWI_IER) SMBus Default Address Match Interrupt Enable Mask */
#define TWI_IER_SMBHHM_Pos                    (21)                                           /**< (TWI_IER) SMBus Host Header Address Match Interrupt Enable Position */
#define TWI_IER_SMBHHM_Msk                    (0x1U << TWI_IER_SMBHHM_Pos)                   /**< (TWI_IER) SMBus Host Header Address Match Interrupt Enable Mask */
#define TWI_IER_Msk                           (0x003D0FF7UL)                                 /**< (TWI_IER) Register Mask  */

/* -------- TWI_IDR : (TWI Offset: 0x28) (/W 32) Interrupt Disable Register -------- */

typedef union
{
  struct
  {
    uint32_t TXCOMP:1;                  /**< bit:      0  Transmission Completed Interrupt Disable      */
    uint32_t RXRDY:1;                   /**< bit:      1  Receive Holding Register Ready Interrupt Disable */
    uint32_t TXRDY:1;                   /**< bit:      2  Transmit Holding Register Ready Interrupt Disable */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t SVACC:1;                   /**< bit:      4  Slave Access Interrupt Disable                */
    uint32_t GACC:1;                    /**< bit:      5  General Call Access Interrupt Disable         */
    uint32_t OVRE:1;                    /**< bit:      6  Overrun Error Interrupt Disable               */
    uint32_t UNRE:1;                    /**< bit:      7  Underrun Error Interrupt Disable              */
    uint32_t NACK:1;                    /**< bit:      8  Not Acknowledge Interrupt Disable             */
    uint32_t ARBLST:1;                  /**< bit:      9  Arbitration Lost Interrupt Disable            */
    uint32_t SCL_WS:1;                  /**< bit:     10  Clock Wait State Interrupt Disable            */
    uint32_t EOSACC:1;                  /**< bit:     11  End Of Slave Access Interrupt Disable         */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t MCACK:1;                   /**< bit:     16  Master Code Acknowledge Interrupt Disable     */
    uint32_t :1;                        /**< bit:     17  Reserved                                      */
    uint32_t TOUT:1;                    /**< bit:     18  Timeout Error Interrupt Disable               */
    uint32_t PECERR:1;                  /**< bit:     19  PEC Error Interrupt Disable                   */
    uint32_t SMBDAM:1;                  /**< bit:     20  SMBus Default Address Match Interrupt Disable */
    uint32_t SMBHHM:1;                  /**< bit:     21  SMBus Host Header Address Match Interrupt Disable */
    uint32_t :10;                       /**< bit: 22..31  Reserved                                      */
  };
  uint32_t w;
} __TWI_IDR_bits_t;

