zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/twi.h
#define TWI_IDR_TXCOMP_Pos                    (0)                                            /**< (TWI_IDR) Transmission Completed Interrupt Disable Position */
#define TWI_IDR_TXCOMP_Msk                    (0x1U << TWI_IDR_TXCOMP_Pos)                   /**< (TWI_IDR) Transmission Completed Interrupt Disable Mask */
#define TWI_IDR_RXRDY_Pos                     (1)                                            /**< (TWI_IDR) Receive Holding Register Ready Interrupt Disable Position */
#define TWI_IDR_RXRDY_Msk                     (0x1U << TWI_IDR_RXRDY_Pos)                    /**< (TWI_IDR) Receive Holding Register Ready Interrupt Disable Mask */
#define TWI_IDR_TXRDY_Pos                     (2)                                            /**< (TWI_IDR) Transmit Holding Register Ready Interrupt Disable Position */
#define TWI_IDR_TXRDY_Msk                     (0x1U << TWI_IDR_TXRDY_Pos)                    /**< (TWI_IDR) Transmit Holding Register Ready Interrupt Disable Mask */
#define TWI_IDR_SVACC_Pos                     (4)                                            /**< (TWI_IDR) Slave Access Interrupt Disable Position */
#define TWI_IDR_SVACC_Msk                     (0x1U << TWI_IDR_SVACC_Pos)                    /**< (TWI_IDR) Slave Access Interrupt Disable Mask */
#define TWI_IDR_GACC_Pos                      (5)                                            /**< (TWI_IDR) General Call Access Interrupt Disable Position */
#define TWI_IDR_GACC_Msk                      (0x1U << TWI_IDR_GACC_Pos)                     /**< (TWI_IDR) General Call Access Interrupt Disable Mask */
#define TWI_IDR_OVRE_Pos                      (6)                                            /**< (TWI_IDR) Overrun Error Interrupt Disable Position */
#define TWI_IDR_OVRE_Msk                      (0x1U << TWI_IDR_OVRE_Pos)                     /**< (TWI_IDR) Overrun Error Interrupt Disable Mask */
#define TWI_IDR_UNRE_Pos                      (7)                                            /**< (TWI_IDR) Underrun Error Interrupt Disable Position */
#define TWI_IDR_UNRE_Msk                      (0x1U << TWI_IDR_UNRE_Pos)                     /**< (TWI_IDR) Underrun Error Interrupt Disable Mask */
#define TWI_IDR_NACK_Pos                      (8)                                            /**< (TWI_IDR) Not Acknowledge Interrupt Disable Position */
#define TWI_IDR_NACK_Msk                      (0x1U << TWI_IDR_NACK_Pos)                     /**< (TWI_IDR) Not Acknowledge Interrupt Disable Mask */
#define TWI_IDR_ARBLST_Pos                    (9)                                            /**< (TWI_IDR) Arbitration Lost Interrupt Disable Position */
#define TWI_IDR_ARBLST_Msk                    (0x1U << TWI_IDR_ARBLST_Pos)                   /**< (TWI_IDR) Arbitration Lost Interrupt Disable Mask */
#define TWI_IDR_SCL_WS_Pos                    (10)                                           /**< (TWI_IDR) Clock Wait State Interrupt Disable Position */
#define TWI_IDR_SCL_WS_Msk                    (0x1U << TWI_IDR_SCL_WS_Pos)                   /**< (TWI_IDR) Clock Wait State Interrupt Disable Mask */
#define TWI_IDR_EOSACC_Pos                    (11)                                           /**< (TWI_IDR) End Of Slave Access Interrupt Disable Position */
#define TWI_IDR_EOSACC_Msk                    (0x1U << TWI_IDR_EOSACC_Pos)                   /**< (TWI_IDR) End Of Slave Access Interrupt Disable Mask */
#define TWI_IDR_MCACK_Pos                     (16)                                           /**< (TWI_IDR) Master Code Acknowledge Interrupt Disable Position */
#define TWI_IDR_MCACK_Msk                     (0x1U << TWI_IDR_MCACK_Pos)                    /**< (TWI_IDR) Master Code Acknowledge Interrupt Disable Mask */
#define TWI_IDR_TOUT_Pos                      (18)                                           /**< (TWI_IDR) Timeout Error Interrupt Disable Position */
#define TWI_IDR_TOUT_Msk                      (0x1U << TWI_IDR_TOUT_Pos)                     /**< (TWI_IDR) Timeout Error Interrupt Disable Mask */
#define TWI_IDR_PECERR_Pos                    (19)                                           /**< (TWI_IDR) PEC Error Interrupt Disable Position */
#define TWI_IDR_PECERR_Msk                    (0x1U << TWI_IDR_PECERR_Pos)                   /**< (TWI_IDR) PEC Error Interrupt Disable Mask */
#define TWI_IDR_SMBDAM_Pos                    (20)                                           /**< (TWI_IDR) SMBus Default Address Match Interrupt Disable Position */
#define TWI_IDR_SMBDAM_Msk                    (0x1U << TWI_IDR_SMBDAM_Pos)                   /**< (TWI_IDR) SMBus Default Address Match Interrupt Disable Mask */
#define TWI_IDR_SMBHHM_Pos                    (21)                                           /**< (TWI_IDR) SMBus Host Header Address Match Interrupt Disable Position */
#define TWI_IDR_SMBHHM_Msk                    (0x1U << TWI_IDR_SMBHHM_Pos)                   /**< (TWI_IDR) SMBus Host Header Address Match Interrupt Disable Mask */
#define TWI_IDR_Msk                           (0x003D0FF7UL)                                 /**< (TWI_IDR) Register Mask  */

/* -------- TWI_IMR : (TWI Offset: 0x2c) (R/ 32) Interrupt Mask Register -------- */

typedef union
{
  struct
  {
    uint32_t TXCOMP:1;                  /**< bit:      0  Transmission Completed Interrupt Mask         */
    uint32_t RXRDY:1;                   /**< bit:      1  Receive Holding Register Ready Interrupt Mask */
    uint32_t TXRDY:1;                   /**< bit:      2  Transmit Holding Register Ready Interrupt Mask */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t SVACC:1;                   /**< bit:      4  Slave Access Interrupt Mask                   */
    uint32_t GACC:1;                    /**< bit:      5  General Call Access Interrupt Mask            */
    uint32_t OVRE:1;                    /**< bit:      6  Overrun Error Interrupt Mask                  */
    uint32_t UNRE:1;                    /**< bit:      7  Underrun Error Interrupt Mask                 */
    uint32_t NACK:1;                    /**< bit:      8  Not Acknowledge Interrupt Mask                */
    uint32_t ARBLST:1;                  /**< bit:      9  Arbitration Lost Interrupt Mask               */
    uint32_t SCL_WS:1;                  /**< bit:     10  Clock Wait State Interrupt Mask               */
    uint32_t EOSACC:1;                  /**< bit:     11  End Of Slave Access Interrupt Mask            */
    uint32_t :4;                        /**< bit: 12..15  Reserved                                      */
    uint32_t MCACK:1;                   /**< bit:     16  Master Code Acknowledge Interrupt Mask        */
    uint32_t :1;                        /**< bit:     17  Reserved                                      */
    uint32_t TOUT:1;                    /**< bit:     18  Timeout Error Interrupt Mask                  */
    uint32_t PECERR:1;                  /**< bit:     19  PEC Error Interrupt Mask                      */
    uint32_t SMBDAM:1;                  /**< bit:     20  SMBus Default Address Match Interrupt Mask    */
    uint32_t SMBHHM:1;                  /**< bit:     21  SMBus Host Header Address Match Interrupt Mask */
    uint32_t :10;                       /**< bit: 22..31  Reserved                                      */
  };
  uint32_t w;
} __TWI_IMR_bits_t;

#define TWI_IMR_TXCOMP_Pos                    (0)                                            /**< (TWI_IMR) Transmission Completed Interrupt Mask Position */
#define TWI_IMR_TXCOMP_Msk                    (0x1U << TWI_IMR_TXCOMP_Pos)                   /**< (TWI_IMR) Transmission Completed Interrupt Mask Mask */
#define TWI_IMR_RXRDY_Pos                     (1)                                            /**< (TWI_IMR) Receive Holding Register Ready Interrupt Mask Position */
#define TWI_IMR_RXRDY_Msk                     (0x1U << TWI_IMR_RXRDY_Pos)                    /**< (TWI_IMR) Receive Holding Register Ready Interrupt Mask Mask */
#define TWI_IMR_TXRDY_Pos                     (2)                                            /**< (TWI_IMR) Transmit Holding Register Ready Interrupt Mask Position */
#define TWI_IMR_TXRDY_Msk                     (0x1U << TWI_IMR_TXRDY_Pos)                    /**< (TWI_IMR) Transmit Holding Register Ready Interrupt Mask Mask */
#define TWI_IMR_SVACC_Pos                     (4)                                            /**< (TWI_IMR) Slave Access Interrupt Mask Position */
#define TWI_IMR_SVACC_Msk                     (0x1U << TWI_IMR_SVACC_Pos)                    /**< (TWI_IMR) Slave Access Interrupt Mask Mask */
#define TWI_IMR_GACC_Pos                      (5)                                            /**< (TWI_IMR) General Call Access Interrupt Mask Position */
#define TWI_IMR_GACC_Msk                      (0x1U << TWI_IMR_GACC_Pos)                     /**< (TWI_IMR) General Call Access Interrupt Mask Mask */
#define TWI_IMR_OVRE_Pos                      (6)                                            /**< (TWI_IMR) Overrun Error Interrupt Mask Position */
#define TWI_IMR_OVRE_Msk                      (0x1U << TWI_IMR_OVRE_Pos)                     /**< (TWI_IMR) Overrun Error Interrupt Mask Mask */
#define TWI_IMR_UNRE_Pos                      (7)                                            /**< (TWI_IMR) Underrun Error Interrupt Mask Position */
#define TWI_IMR_UNRE_Msk                      (0x1U << TWI_IMR_UNRE_Pos)                     /**< (TWI_IMR) Underrun Error Interrupt Mask Mask */
#define TWI_IMR_NACK_Pos                      (8)                                            /**< (TWI_IMR) Not Acknowledge Interrupt Mask Position */
#define TWI_IMR_NACK_Msk                      (0x1U << TWI_IMR_NACK_Pos)                     /**< (TWI_IMR) Not Acknowledge Interrupt Mask Mask */
#define TWI_IMR_ARBLST_Pos                    (9)                                            /**< (TWI_IMR) Arbitration Lost Interrupt Mask Position */
#define TWI_IMR_ARBLST_Msk                    (0x1U << TWI_IMR_ARBLST_Pos)                   /**< (TWI_IMR) Arbitration Lost Interrupt Mask Mask */
#define TWI_IMR_SCL_WS_Pos                    (10)                                           /**< (TWI_IMR) Clock Wait State Interrupt Mask Position */
#define TWI_IMR_SCL_WS_Msk                    (0x1U << TWI_IMR_SCL_WS_Pos)                   /**< (TWI_IMR) Clock Wait State Interrupt Mask Mask */
#define TWI_IMR_EOSACC_Pos                    (11)                                           /**< (TWI_IMR) End Of Slave Access Interrupt Mask Position */
#define TWI_IMR_EOSACC_Msk                    (0x1U << TWI_IMR_EOSACC_Pos)                   /**< (TWI_IMR) End Of Slave Access Interrupt Mask Mask */
#define TWI_IMR_MCACK_Pos                     (16)                                           /**< (TWI_IMR) Master Code Acknowledge Interrupt Mask Position */
#define TWI_IMR_MCACK_Msk                     (0x1U << TWI_IMR_MCACK_Pos)                    /**< (TWI_IMR) Master Code Acknowledge Interrupt Mask Mask */
#define TWI_IMR_TOUT_Pos                      (18)                                           /**< (TWI_IMR) Timeout Error Interrupt Mask Position */
#define TWI_IMR_TOUT_Msk                      (0x1U << TWI_IMR_TOUT_Pos)                     /**< (TWI_IMR) Timeout Error Interrupt Mask Mask */
#define TWI_IMR_PECERR_Pos                    (19)                                           /**< (TWI_IMR) PEC Error Interrupt Mask Position */
#define TWI_IMR_PECERR_Msk                    (0x1U << TWI_IMR_PECERR_Pos)                   /**< (TWI_IMR) PEC Error Interrupt Mask Mask */
#define TWI_IMR_SMBDAM_Pos                    (20)                                           /**< (TWI_IMR) SMBus Default Address Match Interrupt Mask Position */
#define TWI_IMR_SMBDAM_Msk                    (0x1U << TWI_IMR_SMBDAM_Pos)                   /**< (TWI_IMR) SMBus Default Address Match Interrupt Mask Mask */
#define TWI_IMR_SMBHHM_Pos                    (21)                                           /**< (TWI_IMR) SMBus Host Header Address Match Interrupt Mask Position */
#define TWI_IMR_SMBHHM_Msk                    (0x1U << TWI_IMR_SMBHHM_Pos)                   /**< (TWI_IMR) SMBus Host Header Address Match Interrupt Mask Mask */
#define TWI_IMR_Msk                           (0x003D0FF7UL)                                 /**< (TWI_IMR) Register Mask  */

