zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/twi.h
/* -------- TWI_RHR : (TWI Offset: 0x30) (R/ 32) Receive Holding Register -------- */

typedef union
{
  struct
  {
    uint32_t RXDATA:8;                  /**< bit:   0..7  Master or Slave Receive Holding Data          */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __TWI_RHR_bits_t;

#define TWI_RHR_RXDATA_Pos                    (0)                                            /**< (TWI_RHR) Master or Slave Receive Holding Data Position */
#define TWI_RHR_RXDATA_Msk                    (0xFFU << TWI_RHR_RXDATA_Pos)                  /**< (TWI_RHR) Master or Slave Receive Holding Data Mask */
#define TWI_RHR_RXDATA(value)                 (TWI_RHR_RXDATA_Msk & ((value) << TWI_RHR_RXDATA_Pos))
#define TWI_RHR_Msk                           (0x000000FFUL)                                 /**< (TWI_RHR) Register Mask  */

/* -------- TWI_THR : (TWI Offset: 0x34) (/W 32) Transmit Holding Register -------- */

typedef union
{
  struct
  {
    uint32_t TXDATA:8;                  /**< bit:   0..7  Master or Slave Transmit Holding Data         */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __TWI_THR_bits_t;

#define TWI_THR_TXDATA_Pos                    (0)                                            /**< (TWI_THR) Master or Slave Transmit Holding Data Position */
#define TWI_THR_TXDATA_Msk                    (0xFFU << TWI_THR_TXDATA_Pos)                  /**< (TWI_THR) Master or Slave Transmit Holding Data Mask */
#define TWI_THR_TXDATA(value)                 (TWI_THR_TXDATA_Msk & ((value) << TWI_THR_TXDATA_Pos))
#define TWI_THR_Msk                           (0x000000FFUL)                                 /**< (TWI_THR) Register Mask  */

/* -------- TWI_SMBTR : (TWI Offset: 0x38) (R/W 32) SMBus Timing Register -------- */

typedef union
{
  struct
  {
    uint32_t PRESC:4;                   /**< bit:   0..3  SMBus Clock Prescaler                         */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t TLOWS:8;                   /**< bit:  8..15  Slave Clock Stretch Maximum Cycles            */
    uint32_t TLOWM:8;                   /**< bit: 16..23  Master Clock Stretch Maximum Cycles           */
    uint32_t THMAX:8;                   /**< bit: 24..31  Clock High Maximum Cycles                     */
  };
  uint32_t w;
} __TWI_SMBTR_bits_t;

#define TWI_SMBTR_PRESC_Pos                   (0)                                            /**< (TWI_SMBTR) SMBus Clock Prescaler Position */
#define TWI_SMBTR_PRESC_Msk                   (0xFU << TWI_SMBTR_PRESC_Pos)                  /**< (TWI_SMBTR) SMBus Clock Prescaler Mask */
#define TWI_SMBTR_PRESC(value)                (TWI_SMBTR_PRESC_Msk & ((value) << TWI_SMBTR_PRESC_Pos))
#define TWI_SMBTR_TLOWS_Pos                   (8)                                            /**< (TWI_SMBTR) Slave Clock Stretch Maximum Cycles Position */
#define TWI_SMBTR_TLOWS_Msk                   (0xFFU << TWI_SMBTR_TLOWS_Pos)                 /**< (TWI_SMBTR) Slave Clock Stretch Maximum Cycles Mask */
#define TWI_SMBTR_TLOWS(value)                (TWI_SMBTR_TLOWS_Msk & ((value) << TWI_SMBTR_TLOWS_Pos))
#define TWI_SMBTR_TLOWM_Pos                   (16)                                           /**< (TWI_SMBTR) Master Clock Stretch Maximum Cycles Position */
#define TWI_SMBTR_TLOWM_Msk                   (0xFFU << TWI_SMBTR_TLOWM_Pos)                 /**< (TWI_SMBTR) Master Clock Stretch Maximum Cycles Mask */
#define TWI_SMBTR_TLOWM(value)                (TWI_SMBTR_TLOWM_Msk & ((value) << TWI_SMBTR_TLOWM_Pos))
#define TWI_SMBTR_THMAX_Pos                   (24)                                           /**< (TWI_SMBTR) Clock High Maximum Cycles Position */
#define TWI_SMBTR_THMAX_Msk                   (0xFFU << TWI_SMBTR_THMAX_Pos)                 /**< (TWI_SMBTR) Clock High Maximum Cycles Mask */
#define TWI_SMBTR_THMAX(value)                (TWI_SMBTR_THMAX_Msk & ((value) << TWI_SMBTR_THMAX_Pos))
#define TWI_SMBTR_Msk                         (0xFFFFFF0FUL)                                 /**< (TWI_SMBTR) Register Mask  */

/* -------- TWI_FILTR : (TWI Offset: 0x44) (R/W 32) Filter Register -------- */

typedef union
{
  struct
  {
    uint32_t FILT:1;                    /**< bit:      0  RX Digital Filter                             */
    uint32_t PADFEN:1;                  /**< bit:      1  PAD Filter Enable                             */
    uint32_t PADFCFG:1;                 /**< bit:      2  PAD Filter Config                             */
    uint32_t :5;                        /**< bit:   3..7  Reserved                                      */
    uint32_t THRES:3;                   /**< bit:  8..10  Digital Filter Threshold                      */
    uint32_t :21;                       /**< bit: 11..31  Reserved                                      */
  };
  uint32_t w;
} __TWI_FILTR_bits_t;

#define TWI_FILTR_FILT_Pos                    (0)                                            /**< (TWI_FILTR) RX Digital Filter Position */
#define TWI_FILTR_FILT_Msk                    (0x1U << TWI_FILTR_FILT_Pos)                   /**< (TWI_FILTR) RX Digital Filter Mask */
#define TWI_FILTR_PADFEN_Pos                  (1)                                            /**< (TWI_FILTR) PAD Filter Enable Position */
#define TWI_FILTR_PADFEN_Msk                  (0x1U << TWI_FILTR_PADFEN_Pos)                 /**< (TWI_FILTR) PAD Filter Enable Mask */
#define TWI_FILTR_PADFCFG_Pos                 (2)                                            /**< (TWI_FILTR) PAD Filter Config Position */
#define TWI_FILTR_PADFCFG_Msk                 (0x1U << TWI_FILTR_PADFCFG_Pos)                /**< (TWI_FILTR) PAD Filter Config Mask */
#define TWI_FILTR_THRES_Pos                   (8)                                            /**< (TWI_FILTR) Digital Filter Threshold Position */
#define TWI_FILTR_THRES_Msk                   (0x7U << TWI_FILTR_THRES_Pos)                  /**< (TWI_FILTR) Digital Filter Threshold Mask */
#define TWI_FILTR_THRES(value)                (TWI_FILTR_THRES_Msk & ((value) << TWI_FILTR_THRES_Pos))
#define TWI_FILTR_Msk                         (0x00000707UL)                                 /**< (TWI_FILTR) Register Mask  */

