zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/twi.h
/* -------- TWI_SWMR : (TWI Offset: 0x4c) (R/W 32) SleepWalking Matching Register -------- */

typedef union
{
  struct
  {
    uint32_t SADR1:7;                   /**< bit:   0..6  Slave Address 1                               */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t SADR2:7;                   /**< bit:  8..14  Slave Address 2                               */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t SADR3:7;                   /**< bit: 16..22  Slave Address 3                               */
    uint32_t :1;                        /**< bit:     23  Reserved                                      */
    uint32_t DATAM:8;                   /**< bit: 24..31  Data Match                                    */
  };
  uint32_t w;
} __TWI_SWMR_bits_t;

#define TWI_SWMR_SADR1_Pos                    (0)                                            /**< (TWI_SWMR) Slave Address 1 Position */
#define TWI_SWMR_SADR1_Msk                    (0x7FU << TWI_SWMR_SADR1_Pos)                  /**< (TWI_SWMR) Slave Address 1 Mask */
#define TWI_SWMR_SADR1(value)                 (TWI_SWMR_SADR1_Msk & ((value) << TWI_SWMR_SADR1_Pos))
#define TWI_SWMR_SADR2_Pos                    (8)                                            /**< (TWI_SWMR) Slave Address 2 Position */
#define TWI_SWMR_SADR2_Msk                    (0x7FU << TWI_SWMR_SADR2_Pos)                  /**< (TWI_SWMR) Slave Address 2 Mask */
#define TWI_SWMR_SADR2(value)                 (TWI_SWMR_SADR2_Msk & ((value) << TWI_SWMR_SADR2_Pos))
#define TWI_SWMR_SADR3_Pos                    (16)                                           /**< (TWI_SWMR) Slave Address 3 Position */
#define TWI_SWMR_SADR3_Msk                    (0x7FU << TWI_SWMR_SADR3_Pos)                  /**< (TWI_SWMR) Slave Address 3 Mask */
#define TWI_SWMR_SADR3(value)                 (TWI_SWMR_SADR3_Msk & ((value) << TWI_SWMR_SADR3_Pos))
#define TWI_SWMR_DATAM_Pos                    (24)                                           /**< (TWI_SWMR) Data Match Position */
#define TWI_SWMR_DATAM_Msk                    (0xFFU << TWI_SWMR_DATAM_Pos)                  /**< (TWI_SWMR) Data Match Mask */
#define TWI_SWMR_DATAM(value)                 (TWI_SWMR_DATAM_Msk & ((value) << TWI_SWMR_DATAM_Pos))
#define TWI_SWMR_Msk                          (0xFF7F7F7FUL)                                 /**< (TWI_SWMR) Register Mask  */

/* -------- TWI_DR : (TWI Offset: 0xd0) (R/ 32) Debug Register -------- */

typedef union
{
  struct
  {
    uint32_t SWEN:1;                    /**< bit:      0  SleepWalking Enable                           */
    uint32_t CLKRQ:1;                   /**< bit:      1  Clock Request                                 */
    uint32_t SWMATCH:1;                 /**< bit:      2  SleepWalking Match                            */
    uint32_t TRP:1;                     /**< bit:      3  Transfer Pending                              */
    uint32_t :28;                       /**< bit:  4..31  Reserved                                      */
  };
  uint32_t w;
} __TWI_DR_bits_t;

#define TWI_DR_SWEN_Pos                       (0)                                            /**< (TWI_DR) SleepWalking Enable Position */
#define TWI_DR_SWEN_Msk                       (0x1U << TWI_DR_SWEN_Pos)                      /**< (TWI_DR) SleepWalking Enable Mask */
#define TWI_DR_CLKRQ_Pos                      (1)                                            /**< (TWI_DR) Clock Request Position */
#define TWI_DR_CLKRQ_Msk                      (0x1U << TWI_DR_CLKRQ_Pos)                     /**< (TWI_DR) Clock Request Mask */
#define TWI_DR_SWMATCH_Pos                    (2)                                            /**< (TWI_DR) SleepWalking Match Position */
#define TWI_DR_SWMATCH_Msk                    (0x1U << TWI_DR_SWMATCH_Pos)                   /**< (TWI_DR) SleepWalking Match Mask */
#define TWI_DR_TRP_Pos                        (3)                                            /**< (TWI_DR) Transfer Pending Position */
#define TWI_DR_TRP_Msk                        (0x1U << TWI_DR_TRP_Pos)                       /**< (TWI_DR) Transfer Pending Mask */
#define TWI_DR_Msk                            (0x0000000FUL)                                 /**< (TWI_DR) Register Mask  */

/* -------- TWI_WPMR : (TWI Offset: 0xe4) (R/W 32) Write Protection Mode Register -------- */

typedef union
{
  struct
  {
    uint32_t WPEN:1;                    /**< bit:      0  Write Protection Enable                       */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPKEY:24;                  /**< bit:  8..31  Write Protection Key                          */
  };
  uint32_t w;
} __TWI_WPMR_bits_t;

#define TWI_WPMR_WPEN_Pos                     (0)                                            /**< (TWI_WPMR) Write Protection Enable Position */
#define TWI_WPMR_WPEN_Msk                     (0x1U << TWI_WPMR_WPEN_Pos)                    /**< (TWI_WPMR) Write Protection Enable Mask */
#define TWI_WPMR_WPKEY_Pos                    (8)                                            /**< (TWI_WPMR) Write Protection Key Position */
#define TWI_WPMR_WPKEY_Msk                    (0xFFFFFFU << TWI_WPMR_WPKEY_Pos)              /**< (TWI_WPMR) Write Protection Key Mask */
#define TWI_WPMR_WPKEY(value)                 (TWI_WPMR_WPKEY_Msk & ((value) << TWI_WPMR_WPKEY_Pos))
#define   TWI_WPMR_WPKEY_PASSWD_Val           (0x545749U)                                    /**< (TWI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0  */
#define TWI_WPMR_WPKEY_PASSWD                 (TWI_WPMR_WPKEY_PASSWD_Val << TWI_WPMR_WPKEY_Pos)  /**< (TWI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0 Position  */
#define TWI_WPMR_Msk                          (0xFFFFFF01UL)                                 /**< (TWI_WPMR) Register Mask  */

/* -------- TWI_WPSR : (TWI Offset: 0xe8) (R/ 32) Write Protection Status Register -------- */

typedef union
{
  struct
  {
    uint32_t WPVS:1;                    /**< bit:      0  Write Protection Violation Status             */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t WPVSRC:24;                 /**< bit:  8..31  Write Protection Violation Source             */
  };
  uint32_t w;
} __TWI_WPSR_bits_t;

