zeha/xc32/pic32c-source/XC32-arm-gcc/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/twi.h
#define TWI_WPSR_WPVS_Pos                     (0)                                            /**< (TWI_WPSR) Write Protection Violation Status Position */
#define TWI_WPSR_WPVS_Msk                     (0x1U << TWI_WPSR_WPVS_Pos)                    /**< (TWI_WPSR) Write Protection Violation Status Mask */
#define TWI_WPSR_WPVSRC_Pos                   (8)                                            /**< (TWI_WPSR) Write Protection Violation Source Position */
#define TWI_WPSR_WPVSRC_Msk                   (0xFFFFFFU << TWI_WPSR_WPVSRC_Pos)             /**< (TWI_WPSR) Write Protection Violation Source Mask */
#define TWI_WPSR_WPVSRC(value)                (TWI_WPSR_WPVSRC_Msk & ((value) << TWI_WPSR_WPVSRC_Pos))
#define TWI_WPSR_Msk                          (0xFFFFFF01UL)                                 /**< (TWI_WPSR) Register Mask  */

/** \brief TWI register offsets definitions */
#define TWI_CR_OFFSET                (0x00)         /**< (TWI_CR) Control Register Offset */
#define TWI_MMR_OFFSET               (0x04)         /**< (TWI_MMR) Master Mode Register Offset */
#define TWI_SMR_OFFSET               (0x08)         /**< (TWI_SMR) Slave Mode Register Offset */
#define TWI_IADR_OFFSET              (0x0C)         /**< (TWI_IADR) Internal Address Register Offset */
#define TWI_CWGR_OFFSET              (0x10)         /**< (TWI_CWGR) Clock Waveform Generator Register Offset */
#define TWI_SR_OFFSET                (0x20)         /**< (TWI_SR) Status Register Offset */
#define TWI_IER_OFFSET               (0x24)         /**< (TWI_IER) Interrupt Enable Register Offset */
#define TWI_IDR_OFFSET               (0x28)         /**< (TWI_IDR) Interrupt Disable Register Offset */
#define TWI_IMR_OFFSET               (0x2C)         /**< (TWI_IMR) Interrupt Mask Register Offset */
#define TWI_RHR_OFFSET               (0x30)         /**< (TWI_RHR) Receive Holding Register Offset */
#define TWI_THR_OFFSET               (0x34)         /**< (TWI_THR) Transmit Holding Register Offset */
#define TWI_SMBTR_OFFSET             (0x38)         /**< (TWI_SMBTR) SMBus Timing Register Offset */
#define TWI_FILTR_OFFSET             (0x44)         /**< (TWI_FILTR) Filter Register Offset */
#define TWI_SWMR_OFFSET              (0x4C)         /**< (TWI_SWMR) SleepWalking Matching Register Offset */
#define TWI_DR_OFFSET                (0xD0)         /**< (TWI_DR) Debug Register Offset */
#define TWI_WPMR_OFFSET              (0xE4)         /**< (TWI_WPMR) Write Protection Mode Register Offset */
#define TWI_WPSR_OFFSET              (0xE8)         /**< (TWI_WPSR) Write Protection Status Register Offset */

/** \brief TWI register API structure */
typedef struct
{
  __O   __TWI_CR_bits_t                TWI_CR;        /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  __TWI_MMR_bits_t               TWI_MMR;       /**< Offset: 0x04 (R/W  32) Master Mode Register */
  __IO  __TWI_SMR_bits_t               TWI_SMR;       /**< Offset: 0x08 (R/W  32) Slave Mode Register */
  __IO  __TWI_IADR_bits_t              TWI_IADR;      /**< Offset: 0x0C (R/W  32) Internal Address Register */
  __IO  __TWI_CWGR_bits_t              TWI_CWGR;      /**< Offset: 0x10 (R/W  32) Clock Waveform Generator Register */
  __I   uint8_t                        Reserved1[0x0C];
  __I   __TWI_SR_bits_t                TWI_SR;        /**< Offset: 0x20 (R/   32) Status Register */
  __O   __TWI_IER_bits_t               TWI_IER;       /**< Offset: 0x24 ( /W  32) Interrupt Enable Register */
  __O   __TWI_IDR_bits_t               TWI_IDR;       /**< Offset: 0x28 ( /W  32) Interrupt Disable Register */
  __I   __TWI_IMR_bits_t               TWI_IMR;       /**< Offset: 0x2C (R/   32) Interrupt Mask Register */
  __I   __TWI_RHR_bits_t               TWI_RHR;       /**< Offset: 0x30 (R/   32) Receive Holding Register */
  __O   __TWI_THR_bits_t               TWI_THR;       /**< Offset: 0x34 ( /W  32) Transmit Holding Register */
  __IO  __TWI_SMBTR_bits_t             TWI_SMBTR;     /**< Offset: 0x38 (R/W  32) SMBus Timing Register */
  __I   uint8_t                        Reserved2[0x08];
  __IO  __TWI_FILTR_bits_t             TWI_FILTR;     /**< Offset: 0x44 (R/W  32) Filter Register */
  __I   uint8_t                        Reserved3[0x04];
  __IO  __TWI_SWMR_bits_t              TWI_SWMR;      /**< Offset: 0x4C (R/W  32) SleepWalking Matching Register */
  __I   uint8_t                        Reserved4[0x80];
  __I   __TWI_DR_bits_t                TWI_DR;        /**< Offset: 0xD0 (R/   32) Debug Register */
  __I   uint8_t                        Reserved5[0x10];
  __IO  __TWI_WPMR_bits_t              TWI_WPMR;      /**< Offset: 0xE4 (R/W  32) Write Protection Mode Register */
  __I   __TWI_WPSR_bits_t              TWI_WPSR;      /**< Offset: 0xE8 (R/   32) Write Protection Status Register */
} twi_registers_t;
/** @}  end of Two-wire Interface */

#endif /* _PIC32CZ_CA70_TWI_COMPONENT_H_ */
